Dantellevi/STM32_Lessons_Projects/Lesson_STM32/project_study/project1/Run_Led/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"
unsigned char count_Led=0;
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);
static void MX_GPIO_Init(void);
void Run1(void);
void Run2(void);
void Run3(void);
/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();

  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  
		if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)==GPIO_PIN_SET)
		{
			count_Led+=1;						
		}
		switch(count_Led)
		{
			case 1 :{
			Run1();
			break;
			}
			
			
			case 2 :{
			Run2();
			break;
			}
			
			
			case 3 :{
			Run3();
			break;
			}
			
			
				
			
		}
		
		if(count_Led>4) count_Led=0;
		
		
		
  }
  /* USER CODE END 3 */

}

void Run1(void)
{
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_0);
	HAL_Delay(450);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_0);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_1);
	HAL_Delay(450);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_1);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_2);
	HAL_Delay(450);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_2);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_3);
	HAL_Delay(450);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_3);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_4);
	HAL_Delay(450);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_4);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_5);
	HAL_Delay(450);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_5);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_6);
	HAL_Delay(450);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_6);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_7);
	HAL_Delay(450);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_7);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_8);
	HAL_Delay(450);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_8);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_9);
	HAL_Delay(450);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_9);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_10);
	HAL_Delay(450);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_10);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_11);
	HAL_Delay(450);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_11);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_12);
	HAL_Delay(450);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_12);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_13);
	HAL_Delay(450);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_13);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_14);
	HAL_Delay(450);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_14);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_15);
	HAL_Delay(450);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_15);
	HAL_Delay(450);
	
}


void Run2(void)
{
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_0);
	HAL_Delay(250);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_0);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_1);
	HAL_Delay(250);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_1);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_2);
	HAL_Delay(250);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_2);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_3);
	HAL_Delay(250);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_3);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_4);
	HAL_Delay(250);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_4);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_5);
	HAL_Delay(250);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_5);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_6);
	HAL_Delay(250);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_6);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_7);
	HAL_Delay(250);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_7);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_8);
	HAL_Delay(250);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_8);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_9);
	HAL_Delay(250);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_9);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_10);
	HAL_Delay(250);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_10);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_11);
	HAL_Delay(250);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_11);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_12);
	HAL_Delay(250);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_12);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_13);
	HAL_Delay(250);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_13);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_14);
	HAL_Delay(250);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_14);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_15);
	HAL_Delay(250);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_15);
	HAL_Delay(450);
	
}




void Run3(void)
{
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_0);
	HAL_Delay(100);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_0);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_1);
	HAL_Delay(100);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_1);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_2);
	HAL_Delay(100);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_2);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_3);
	HAL_Delay(100);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_3);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_4);
	HAL_Delay(100);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_4);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_5);
	HAL_Delay(100);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_5);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_6);
	HAL_Delay(100);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_6);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_7);
	HAL_Delay(100);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_7);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_8);
	HAL_Delay(100);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_8);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_9);
	HAL_Delay(100);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_9);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_10);
	HAL_Delay(100);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_10);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_11);
	HAL_Delay(100);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_11);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_12);
	HAL_Delay(100);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_12);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_13);
	HAL_Delay(100);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_13);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_14);
	HAL_Delay(100);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_14);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_15);
	HAL_Delay(100);
	HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_15);
	HAL_Delay(450);
	
}



/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 168;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV4;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
*/
static void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_8|GPIO_PIN_9|GPIO_PIN_10|GPIO_PIN_11 
                          |GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15 
                          |GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3 
                          |GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7, GPIO_PIN_RESET);

  /*Configure GPIO pin : PA0 */
  GPIO_InitStruct.Pin = GPIO_PIN_0;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : PD8 PD9 PD10 PD11 
                           PD12 PD13 PD14 PD15 
                           PD0 PD1 PD2 PD3 
                           PD4 PD5 PD6 PD7 */
  GPIO_InitStruct.Pin = GPIO_PIN_8|GPIO_PIN_9|GPIO_PIN_10|GPIO_PIN_11 
                          |GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15 
                          |GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3 
                          |GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
